# St7SetSolverNonlinearMaterial

Sets the state of the Nonlinear Material option for nonlinear analyses.

long St7SetSolverNonlinearMaterial(long uID, bool NonlinearMaterial)
Input Parameters
uID
Strand7 model file ID.
NonlinearMaterial
True to enable the Nonlinear Material option.